---
kind: method
id: M:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.Dispose
source: html/1a497801-3cd1-556a-6d7b-5024ddf0c204.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.Dispose Method

Releases all resources used by the RevisionsOnSheetUIServiceData

## Syntax (C#)
```csharp
public void Dispose()
```